src/cf/Catalogs/мвв_ОбъектыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>мвв_ОбъектыСтрахования</Name>
			<Comment>(Упр.)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнойОбъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ОбъектыСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ТипыОбъектовСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Территория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_Территории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактированиеТекстаНаименования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияСвойств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_РазделыСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.мвв_СвойстваОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСвойства</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.мвв_СвойстваОбъектов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/мвв_НазначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>мвв_НазначенияСвойствОбъектов</Name>
			<Comment>(Упр.)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_РазделыСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбязателенДляЗаполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НастройкиЗаполнения</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредставлениеЗаполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.мвв_НазначениеСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.мвв_СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/мвв_ОбъектыСтрахования/Ext/ObjectModule.bsl
// Функция возвращает результат запроса по справочнику контрагентов с заданным головным контрагентом
//
// Параметры:
//  ГоловнойКонтрагент - заданный головной контрагент
//
// Возвращаемое значение:
//  Результат - результат работы запроса
// 
Функция ПолучитьОбъектыПоЗаданномуГоловномуОбъекту(ГоловнойОбъект) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ГоловнойОбъект", ГоловнойОбъект);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Объекты.Ссылка КАК Объект
	|ИЗ
	|	Справочник.ус_ОбъектыСтрахования КАК Объекты
	|
	|ГДЕ
	|	Объекты.ГоловнойОбъект = &ГоловнойОбъект
	|   и Объекты.ГоловнойОбъект <> Объекты.Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	Объект";
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат;
	
КонецФункции // ПолучитьОбъектыПоЗаданномуГоловномуОбъекту()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Обработчик события ПередЗаписью
//
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(ГоловнойОбъект) И ГоловнойОбъект <> Ссылка Тогда

		Если ЗначениеЗаполнено(ГоловнойОбъект.ГоловнойОбъект) И ГоловнойОбъект.ГоловнойОбъект <> ГоловнойОбъект Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Объект "+СокрЛП(ГоловнойОбъект)+" не может быть выбран головным, 
							|так как для него уже был назначен головной объект "+СокрЛП(ГоловнойОбъект.ГоловнойОбъект)+"!");
			Отказ = Истина;
			Возврат;
		Иначе

			// надо проверить, что если указываем головного объекта, то этот элемент уже не был установлен
			// в качестве головного у другого объекта.
			ВыборкаПоГоловномуОбъекту = ПолучитьОбъектыПоЗаданномуГоловномуОбъекту(Ссылка).Выбрать();
			Если ВыборкаПоГоловномуОбъекту.Количество() <> 0 Тогда

				СообщениеОНевозможностиЗаписи = "Объект "+СокрЛП(ЭтотОбъект)+" не может иметь головного объекта!
												|Этот объект уже установлен головным для: ";
				Пока ВыборкаПоГоловномуОбъекту.Следующий() Цикл
					СообщениеОНевозможностиЗаписи = СообщениеОНевозможностиЗаписи + Символы.ПС + СокрЛП(ВыборкаПоГоловномуОбъекту.Объект);
				КонецЦикла;

				ОбщегоНазначения.СообщитьОбОшибке(СообщениеОНевозможностиЗаписи);
				Отказ = Истина;
				Возврат;

			КонецЕсли;

		КонецЕсли;

	КонецЕсли;
КонецПроцедуры // ПередЗаписью()

Процедура ЗаполнитьСвойстваОбъекта() Экспорт
	ЭтотОбъект.ЗначенияСвойств.Очистить();
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ТипОбъекта) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнен тип объекта");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	мвв_НазначенияСвойствОбъектов.Свойство КАК Свойство,
	               |	мвв_НазначенияСвойствОбъектов.Раздел КАК Раздел,
	               |	мвв_НазначенияСвойствОбъектов.Порядок КАК Порядок
	               |ИЗ
	               |	РегистрСведений.мвв_НазначенияСвойствОбъектов КАК мвв_НазначенияСвойствОбъектов
	               |ГДЕ
	               |	мвв_НазначенияСвойствОбъектов.Объект = &Объект
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	Запрос.УстановитьПараметр("Объект", ЭтотОбъект.ТипОбъекта);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		тНовСтрока = ЭтотОбъект.ЗначенияСвойств.Добавить();
		ЗаполнитьЗначенияСвойств(тНовСтрока, Выборка);
	КонецЦикла;
КонецПроцедуры
